DanielR92/CMT2300A/RP2040/main.cpp
#define CMT2300A_MASK_TX_DONE_FLG       0x08
#define CMT2300A_MASK_PKT_OK_FLG        0x01

#define CRC8_INIT                       0x00
#define CRC8_POLY                       0x01

#define CRC16_MODBUS_POLYNOM            0xA001

#define U32_B3(val) ((uint8_t)((val >> 24) & 0xff))
#define U32_B2(val) ((uint8_t)((val >> 16) & 0xff))
#define U32_B1(val) ((uint8_t)((val >>  8) & 0xff))
#define U32_B0(val) ((uint8_t)((val      ) & 0xff))

#ifdef RP2040
    typedef RP2040Spi3w SpiType;
#else
    typedef SoftSpi3w<DEF_CS_PIN, DEF_FCS_PIN, DEF_SCK_PIN, DEF_SDIO_PIN> SpiType;
#endif

SpiType spi3w;
uint32_t cnt;

uint8_t mLastFreq;
uint8_t mStartFreq;
uint8_t mEndFreq;
bool mFound;
uint32_t mPrevMillis;

// config
uint32_t ts  = 0x6384DF00; // timestamp
uint32_t dtu = 0x83266790;
uint32_t wr  = 0x80423810;
// end config

void rxLoop(void);

uint8_t getChipStatus(void) {
    return spi3w.readReg(CMT2300A_CUS_MODE_STA) & CMT2300A_MASK_CHIP_MODE_STA;
}

//-----------------------------------------------------------------------------
uint8_t crc8(uint8_t buf[], uint8_t len) {
    uint8_t crc = CRC8_INIT;
    for(uint8_t i = 0; i < len; i++) {
        crc ^= buf[i];
        for(uint8_t b = 0; b < 8; b ++) {
            crc = (crc << 1) ^ ((crc & 0x80) ? CRC8_POLY : 0x00);
        }
    }
    return crc;
}

//-----------------------------------------------------------------------------
uint16_t crc16(uint8_t buf[], uint8_t len, uint16_t start) {
    uint16_t crc = start;
    uint8_t shift = 0;

    for(uint8_t i = 0; i < len; i ++) {
        crc = crc ^ buf[i];
        for(uint8_t bit = 0; bit < 8; bit ++) {
            shift = (crc & 0x0001);
            crc = crc >> 1;
            if(shift != 0)
                crc = crc ^ CRC16_MODBUS_POLYNOM;
        }
    }
    return crc;
}

//-----------------------------------------------------------------------------
void dumpBuf(const char* des, uint8_t buf[], uint8_t len) {
    Serial.println("------------------");
    Serial.println(String(des));
    for(uint8_t i = 0; i < len; i++) {
        if((0 != i) && (i % 8 == 0))
            Serial.println("");
        Serial.print(String(buf[i], HEX) + " ");
    }
    Serial.println("");
}

//-----------------------------------------------------------------------------
bool cmtSwitchStatus(uint8_t cmd, uint8_t waitFor, uint16_t cycles = 50000) {
    spi3w.writeReg(CMT2300A_CUS_MODE_CTL, cmd);
    while(cycles--) {
        delayMicroseconds(10);
        if(waitFor == getChipStatus())
            return true;
    }
    Serial.println("status wait for: " + String(waitFor, HEX) + " read: " + String(getChipStatus(), HEX));
    return false;
}

//-----------------------------------------------------------------------------
void switchFreq(void) {
    if(++mLastFreq > mEndFreq)
        mLastFreq = mStartFreq;
    spi3w.writeReg(CMT2300A_CUS_FREQ_CHNL, mLastFreq);
}

//-----------------------------------------------------------------------------
int8_t rxInit(void) {
    int8_t rssi = spi3w.readReg(CMT2300A_CUS_RSSI_DBM) - 128;

    if(!cmtSwitchStatus(CMT2300A_GO_SLEEP, CMT2300A_STA_SLEEP))
        Serial.println("warn: not switched to sleep mode!");

    if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
        Serial.println("warn: not switched to standby mode!");

    return rssi;
}

//-----------------------------------------------------------------------------
int8_t checkRx() {
    int8_t rssi = -128;
    if(CMT2300A_INT_SEL_TX_DONE != spi3w.readReg(CMT2300A_CUS_INT1_CTL))
        spi3w.writeReg(CMT2300A_CUS_INT1_CTL, CMT2300A_INT_SEL_TX_DONE);

    if(0x00 == spi3w.readReg(CMT2300A_CUS_INT_FLAG)) {
        // no data received
        uint8_t tmp = spi3w.readReg(CMT2300A_CUS_INT_CLR1);
        if(0x08 == tmp) // first time after TX this reg is 0x08
            spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x04);
        else
            spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x00);
        spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x00);

        spi3w.readReg(CMT2300A_CUS_FIFO_CTL); // necessary?
        spi3w.writeReg(CMT2300A_CUS_FIFO_CTL, 0x02);

        spi3w.writeReg(CMT2300A_CUS_FIFO_CLR, 0x02);
        spi3w.writeReg(0x16, 0x0C);

        switchFreq();

        if(!cmtSwitchStatus(CMT2300A_GO_RX, CMT2300A_STA_RX))
            Serial.println("warn: cant reach RX mode!");

        uint8_t state = 0x00;
        for(uint8_t i = 0; i < 52; i++) {
            state = spi3w.readReg(CMT2300A_CUS_INT_FLAG);
            if(0x00 != state)
                break;
        }

        if(0x00 != state) {
            uint32_t loops = 0;
            rssi = spi3w.readReg(CMT2300A_CUS_RSSI_DBM) - 128;
            while((state & 0x1b) != 0x1b) {
                state = spi3w.readReg(CMT2300A_CUS_INT_FLAG);

                if((state & 0x18) == 0x18)
                    delay(23);

                if((state & 0x20) == 0x20) {
                    Serial.println("receive PKT ERROR");
                    break;
                }
                else if((state & 0x40) == 0x40) {
                    Serial.println("receive COL ERROR");
                    break;
                }

                if(++loops > 500000) {
                    Serial.println("receive error, loops");
                    break;
                }
            }
        }

        if(!cmtSwitchStatus(CMT2300A_GO_STBY, CMT2300A_STA_STBY))
            Serial.println("warn: not switched to standby mode!");

        // receive ok (pream, sync, node, crc)
        if((state & 0x1b) == 0x1b) {
            uint8_t buf[27] = {0};
            spi3w.readFifo(buf, 27);

            // only print buffer if one field is not equal 0
            for(uint8_t i = 0; i < 27; i++) {
                if(buf[i] != 0) {
                    dumpBuf("RX", buf, 27);
                    mFound = true;
                    break;
                }
            }

            rssi = spi3w.readReg(CMT2300A_CUS_RSSI_DBM) - 128;
        }
    }

    return rssi;
}

//-----------------------------------------------------------------------------
void txData(uint8_t buf[], uint8_t len, bool calcCrc16 = true, bool calcCrc8 = true) {
    if(CMT2300A_INT_SEL_TX_DONE != spi3w.readReg(CMT2300A_CUS_INT1_CTL))
        spi3w.writeReg(CMT2300A_CUS_INT1_CTL, CMT2300A_INT_SEL_TX_DONE);

    if(0x00 == spi3w.readReg(CMT2300A_CUS_INT_FLAG)) {
        // no data received
        if(0x00 != spi3w.readReg(CMT2300A_CUS_INT_CLR1))
            spi3w.writeReg(CMT2300A_CUS_INT_CLR1, 0x00);
        spi3w.writeReg(CMT2300A_CUS_INT_CLR2, 0x00);

        spi3w.readReg(CMT2300A_CUS_FIFO_CTL); // necessary?
        spi3w.writeReg(CMT2300A_CUS_FIFO_CTL, 0x07);

